The Project File. Everything gets tangled out to its proper place.
** Menu in Left Panel
   :PROPERTIES:
   :header-args: :tangle "_site/css/leftmenu.css"
   :END:
   :LOGBOOK:
   CLOCK: [2019-07-13 Sat 16:45]--[2019-07-13 Sat 17:49] =>  1:04
   :END:
 # +PROPERTY: header-args :tangle "_site/css/leftmenu.css"
 Style for html created from org-mode. Puts table of contents as a menu on
 the left side. Header-args doesn't work, it uses the src/bindings.purs from
 below. Fails silently when parent directory does not exist.
** Menu on Top
   :PROPERTIES:
   :header-args: :tangle "_site/css/topmenu.css"
   :END:
   :LOGBOOK:
   CLOCK: [2019-07-15 Mon 16:57]--[2019-07-15 Mon 19:17] =>  2:20
   :END:
This should essentially be a navbar across the top with dropdown functionality.
This doesn't work: put the navbar accross the side-menu as in thibaultmarin.
Otherwise put it in a preamble.
For the horizontal bar, see
https://css-snippets.com/simple-horizontal-navigation/.
Also see http://www.ucs.mun.ca/~branigan/css/pjb-updated.css for how to make
this work with a title, as this is a site generated by org-mode.

The body has to have a top padding in order to keep the content below the 
naviagation bar. Doesn't work.
#+BEGIN_SRC css
body {
  padding-top: 70px;
} 
#+END_SRC
The navigation section:
#+BEGIN_SRC css
nav {
    margin: 0;
    padding: 0;
    width: 100%;
    position: fixed;
    top: 0px;
    left: 0px;
    overflow: auto;
    background-color: DarkGreen;
}
#+END_SRC
All the lists in navigation will be invisible,
#+BEGIN_SRC css
nav ul {
    list-style-type: none;
    display: none;
}
#+End_SRC
except for the top-level ones. 
#+BEGIN_SRC css
nav > div > ul {
   margin: 0;
   padding: 0; /*for better centering*/
   display: block;
}
#+END_SRC
See how this looks and change marging and/or padding if necessary. Note that
with padding the list may be slightly off-centre.

For the top list to go across, the list elements need to flow left.
#+BEGIN_SRC css
nav > div > ul > li {
   /*float: left;*/
   display: inline-block;
}
/*But this needs adjustments to nav ul:*/
nav ul {
   overflow: auto;
   width: 100%;
   margin: 0 auto;
}
/*and perhaps to the background colour of nav*/
#+END_SRC
Note that this can also be achieved by setting ~display~ to ~inline-block~ instead
of using ~float~.
The sections have to move down. This will move them down from their original
position.
#+BEGIN_SRC css
section {
   height: 1000px;
}
#+END_SRC
* Menu Bindings to Org-Generated HTML
  :PROPERTIES:
  :header-args: :tangle "src/bindings.purs"
  :END:
# Note: +PROPERTY is no good because it is buffer global, that's why it is
# commented out
# +PROPERTY: header-args :tangle "src/bindings.purs"
  :LOGBOOK:
  CLOCK: [2019-07-07 Sun 09:37]--[2019-07-07 Sun 12:23] =>  2:46
  CLOCK: [2019-07-06 Sat 11:20]--[2019-07-06 Sat 13:29] =>  2:09
  CLOCK: [2019-07-05 Fri 09:12]--[2019-07-05 Fri 11:15] =>  2:03
  CLOCK: [2019-07-03 Wed 11:07]--[2019-07-03 Wed 13:44] =>  2:37
  CLOCK: [2019-07-02 Tue 09:13]--[2019-07-02 Tue 12:48] =>  3:35
  CLOCK: [2019-07-01 Mon 12:27]--[2019-07-01 Mon 21:30] =>  9:03
  CLOCK: [2019-06-30 Sun 18:43]--[2019-06-30 Sun 20:34] =>  1:51
  :END:
# TODO: remove obsolete code, the toArray functionality for HTMLCollection
# and NodeList has side-effects that prevent the setting of eg. class names
# on the corresponding elements. Can remove the experimental code, see the
# resetActive function for the differences. Put the css-code into this file
# as well and tangle it out to

Functions to bind to the nav-menu to get some functionality. There are two
functions currently:
 - An Activation Listener :: 
   When clicking an anchor in a list item in a menu, this anchor becomes
   active by setting class /active/ on it. This is like a focus in the sense
   that all other anchors in the menu become inactive.
 - An Expansion Listener ::
   When clicking an anchor in a menu, the class /expanded/ is toggled for that
   anchor. Styling is used to expand the sub-menu for that anchor while it is
   expanded. Other than with activation, several anchors can be expanded at
   the same time.
